Revit 2027 API
CitySet.Erase Method
Removes a specified city from the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	City item
)
Public Overridable Function Erase (
	item As City
) As Integer
public:
virtual int Erase(
	City^ item
)
abstract Erase :
        item : City -> int
override Erase :
        item : City -> int
Parameters
item City
The city to be erased.
Return Value
Int32
The number of cities that were erased from the set.
See Also
Reference
CitySet Class
Autodesk.Revit.DB Namespace